тестовая/src/Documents/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФизическиеЛица</name>
  <registerRecords>InformationRegister.РегистрПоФизЛицам</registerRecords>
  <attributes>
    <name>ПолноеФИО</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должность</types>
    </type>
  </attributes>
  <attributes>
    <name>СтажРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

тестовая/src/InformationRegisters/РегистрПоФизЛицам/РегистрПоФизЛицам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрПоФизЛицам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ФИО</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должность</types>
    </type>
  </resources>
  <resources>
    <name>СтажРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодСтажировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

тестовая/src/Documents/ФизическиеЛица/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РегистрПоФизЛицам
	Движения.РегистрПоФизЛицам.Записывать = Истина;
	Движение = Движения.РегистрПоФизЛицам.Добавить();
	Движение.Период = Дата;
	Движение.ФИО = ПолноеФИО;
	Движение.Должность = Должность;
	Движение.СтажРаботы = СтажРаботы;
	Движение.ПериодСтажировки = Период;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
